"""
Класс Circle

Реализуйте класс Circle, описывающий круг. При создании экземпляра класс должен принимать один аргумент:
    radius — радиус круга
Экземпляр класса Circle должен иметь три атрибута:
    radius — радиус круга
    diameter — диаметр круга
    area — площадь круга
"""


# Код:
class Circle:
    pass


# тест 1
circle = Circle(1)
print(circle.radius)  # 1
# тест 2
circle = Circle(5)
print(circle.radius)  # 5
print(circle.diameter)  # 10
print(circle.area)  # 78.53981633974483
