'''
Функция limited_hash() 🌶️
Реализуйте функцию limited_hash(), которая принимает три аргумента в следующем порядке:
    left — целое число
    right — целое число
    hash_function — хеш-функция, по умолчанию равняется встроенной функции hash()
Функция должна возвращать новую функцию, которая принимает в качестве аргумента произвольный объект,
    вычисляет его хеш-значение с помощью функции hash_function(),
    преобразует его в число, принадлежащее диапазону [left; right], и возвращает полученный результат.
Если вычисленное хеш-значение уже принадлежит диапазону [left; right], то функция должна возвращать его без преобразования.
    Если вычисленное хеш-значение равняется right + 1, то функция перед возвратом должна преобразовать его в left,
    если right + 2 — в left + 1, если right + 3 — в left + 2, и так далее.
    Аналогичные преобразования, но в другую сторону, должны выполняться для хеш-значений, которые меньше left.
    Преобразования должны выполняться циклично при очередном выходе из диапазона.
'''


def limited_hash(left, right, hash_function=hash):
    ...


if __name__ == '__main__':
    # test 1
    hash_function = limited_hash(10, 15)
    print(hash_function(10))  # 10
    print(hash_function(11))  # 11
    print(hash_function(15))  # 15
    # test 2
    hash_function = limited_hash(10, 15)
    print(hash_function(16))  # 10
    print(hash_function(17))  # 11
    print(hash_function(21))  # 15
    print(hash_function(22))  # 10
    print(hash_function(23))  # 11
    # test 3
    hash_function = limited_hash(10, 15)
    print(hash_function(9))  # 15
    print(hash_function(8))  # 14
    print(hash_function(4))  # 10
    print(hash_function(3))  # 15
    print(hash_function(2))  # 14
