"""
Реализуйте класс Calculator, экземпляры которого позволяют выполнять различные арифметические операции с двумя числами.
    При создании экземпляра класс не должен принимать никаких аргументов.
Экземпляр класса Calculator должен являться вызываемым объектом и принимать три аргумента:
    a — число
    b — число
    operation — один из символов +, -, * и /
Если operation равняется +, экземпляр класса Calculator должен вернуть сумму a и b,
    если - — разность a и b, если * — произведение a и b, если / — частное a и b.
    При попытке выполнить деление на ноль должно быть возбуждено исключение ValueError с текстом:
        Деление на ноль невозможно
"""
class Calculator:
    pass

if __name__ == '__main__':
    # Test 1
    calculator = Calculator()

    print(calculator(10, 5, '+')) # 15
    print(calculator(10, 5, '-')) # 5
    print(calculator(10, 5, '*')) # 50
    print(calculator(10, 5, '/')) # 2.0

    # Test 2
    calculator = Calculator()

    try:
        print(calculator(10, 0, '/'))
    except ValueError as e:
        print(e) #     Деление на ноль невозможно
        print(type(e)) # <class 'ValueError'>